du4/LPC54605_USB_VCOM/source/virtual_com.c
/*
 * Copyright (c) 2015 - 2016, Freescale Semiconductor, Inc.
 * Copyright 2016 - 2017 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>
#include "fsl_device_registers.h"
#include "fsl_debug_console.h"
#include "pin_mux.h"
#include "clock_config.h"
#include "board.h"

#include "usb_device_config.h"
#include "usb.h"
#include "usb_device.h"

#include "usb_device_class.h"
#include "usb_device_cdc_acm.h"
#include "usb_device_ch9.h"

#include "usb_device_descriptor.h"
#include "virtual_com.h"
#if (defined(FSL_FEATURE_SOC_SYSMPU_COUNT) && (FSL_FEATURE_SOC_SYSMPU_COUNT > 0U))
#include "fsl_sysmpu.h"
#endif /* FSL_FEATURE_SOC_SYSMPU_COUNT */

#if ((defined FSL_FEATURE_SOC_USBPHY_COUNT) && (FSL_FEATURE_SOC_USBPHY_COUNT > 0U))
#include "usb_phy.h"
#endif
#if defined(FSL_FEATURE_USB_KHCI_KEEP_ALIVE_ENABLED) && (FSL_FEATURE_USB_KHCI_KEEP_ALIVE_ENABLED > 0U) && \
    defined(USB_DEVICE_CONFIG_KEEP_ALIVE_MODE) && (USB_DEVICE_CONFIG_KEEP_ALIVE_MODE > 0U) &&             \
    defined(FSL_FEATURE_USB_KHCI_USB_RAM) && (FSL_FEATURE_USB_KHCI_USB_RAM > 0U)
extern uint8_t USB_EnterLowpowerMode(void);
#endif
#include "fsl_power.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
void BOARD_InitHardware(void);
void USB_DeviceClockInit(void);
void USB_DeviceIsrEnable(void);
#if USB_DEVICE_CONFIG_USE_TASK
void USB_DeviceTaskFn(void *deviceHandle);
#endif

void BOARD_DbgConsole_Deinit(void);
void BOARD_DbgConsole_Init(void);
usb_status_t USB_DeviceCdcVcomCallback(class_handle_t handle, uint32_t event, void *param);
usb_status_t USB_DeviceCallback(usb_device_handle handle, uint32_t event, void *param);

/*******************************************************************************
 * Variables
 ******************************************************************************/
extern usb_device_endpoint_struct_t g_UsbDeviceCdcVcomDicEndpoints[];
extern usb_device_class_struct_t g_UsbDeviceCdcVcomConfig;
/* Data structure of virtual com device */
usb_cdc_vcom_struct_t s_cdcVcom;

/* Line coding of cdc device */
USB_DMA_INIT_DATA_ALIGN(USB_DATA_ALIGN_SIZE)
static uint8_t s_lineCoding[LINE_CODING_SIZE] = {
    /* E.g. 0x00,0xC2,0x01,0x00 : 0x0001C200 is 115200 bits per second */
    (LINE_CODING_DTERATE >> 0U) & 0x000000FFU,
    (LINE_CODING_DTERATE >> 8U) & 0x000000FFU,
    (LINE_CODING_DTERATE >> 16U) & 0x000000FFU,
    (LINE_CODING_DTERATE >> 24U) & 0x000000FFU,
    LINE_CODING_CHARFORMAT,
    LINE_CODING_PARITYTYPE,
    LINE_CODING_DATABITS};


// USER VARIABLES //
char str[80];
//uint32_t TX_SIZE = 60;//sizeof(cdc_tx_buf);
//uint8_t  cdc_tx_buf[TX_SIZE];// = "LPC would like to share my experience to create test application and measure the USB performance for both FS and HS with external ULPI PHY (USB3300) on STM32F4 MCU series. To do that Olimex STM32-H405 board and USB3300 module was used as hardware. Because of high speed the connection between them was made with very short wires and using default pin connection case with USB3300 reset pin connected to PA6. In addition to use default USB FS Device pin-out USB_P was re-wired from PC4 to PA9. For debugging USART\r\n";
uint32_t cutId = 0;
uint32_t cutStatus = 0x08000000;
uint32_t usb_sop = 0x00000071;
uint32_t uninterruptableMeasurementWatchdog = 0;
uint32_t g_systickCounter = 0;

QLpcPacket pLpcBufToSend;

void fillUsbCutMuxSample(uint8_t* cdc_tx_buf_pointer){
	uint64_t longValue = 0;
	uint16_t adc12BitArray[LPC_ADC_SIZE], index;
	for (int step = 0; step < 8; ++step) {
		longValue = 0;

		for (int i = 0; i < LPC_ADC_SIZE; ++i) {
			index = LPC_ADC_SIZE - 1 - i;
			adc12BitArray[i] = (i/2)*100 + 10*step + (2*DEVICE_ID+i%2); // 100=section 10=step 1=electrode
			longValue |= (uint64_t)((uint64_t)adc12BitArray[index] << (i*12));
		}
		longValue = (longValue & 0x00000000FFFFFFFF) << 32 | (longValue & 0xFFFFFFFF00000000) >> 32;
		longValue = (longValue & 0x0000FFFF0000FFFF) << 16 | (longValue & 0xFFFF0000FFFF0000) >> 16;
		longValue = (longValue & 0x00FF00FF00FF00FF) << 8  | (longValue & 0xFF00FF00FF00FF00) >> 8;
		longValue = longValue>>16;
		memcpy((cdc_tx_buf_pointer + 6*step) ,  &longValue, 6);
	}
}

void fillLpcEctHsSampleData(uint32_t cutId, QLpcPacket* pLpcBufToSend, int cutsPerPacket){
	int stepSize = 8;
	uint32_t status = 0x08000000;
	float value;
	float* elSamples;//[elSize][LPC_ADC_SIZE];


//	for (int mcu = 0; mcu < LPC_MCU_SIZE; ++mcu) {
		pLpcBufToSend->command = usb_sop;
		for (uint8_t cut= 0; cut < cutsPerPacket; ++cut) {
			pLpcBufToSend->packets[cut].cutIndex = cutId - cutsPerPacket + cut;
			pLpcBufToSend->packets[cut].status = status | ((DEVICE_ID << 20) & 0x00F00000) | cut;
			elSamples = (float*)(&pLpcBufToSend->packets[cut].data[0]);

			for (int step = 0; step < stepSize; ++step) {
				for (int adc = 0; adc < LPC_ADC_SIZE; ++adc) {
					value = (1000*(adc%2) +	DEVICE_ID*100 + adc/2*10 + step) * 4095.0/3.3 ;
					*(elSamples + (LPC_ADC_SIZE*step + adc)) = value;
				}
			}
		}
//		pLpcBufToSend++;
//	}
}


void SysTick_Handler(void){
    g_systickCounter++;
}

////////////////////////////////////////



/* Abstract state of cdc device */
USB_DMA_INIT_DATA_ALIGN(USB_DATA_ALIGN_SIZE)
static uint8_t s_abstractState[COMM_FEATURE_DATA_SIZE] = {(STATUS_ABSTRACT_STATE >> 0U) & 0x00FFU,
                                                          (STATUS_ABSTRACT_STATE >> 8U) & 0x00FFU};

/* Country code of cdc device */
USB_DMA_INIT_DATA_ALIGN(USB_DATA_ALIGN_SIZE)
static uint8_t s_countryCode[COMM_FEATURE_DATA_SIZE] = {(COUNTRY_SETTING >> 0U) & 0x00FFU,
                                                        (COUNTRY_SETTING >> 8U) & 0x00FFU};

/* CDC ACM information */
USB_DMA_NONINIT_DATA_ALIGN(USB_DATA_ALIGN_SIZE) static usb_cdc_acm_info_t s_usbCdcAcmInfo;
/* Data buffer for receiving and sending*/
USB_DMA_NONINIT_DATA_ALIGN(USB_DATA_ALIGN_SIZE) static uint8_t s_currRecvBuf[DATA_BUFF_SIZE];
USB_DMA_NONINIT_DATA_ALIGN(USB_DATA_ALIGN_SIZE) static uint8_t s_currSendBuf[DATA_BUFF_SIZE];
volatile static uint32_t s_recvSize = 0;
volatile static uint32_t s_sendSize = 0;

/* USB device class information */
static usb_device_class_config_struct_t s_cdcAcmConfig[1] = {{
    USB_DeviceCdcVcomCallback,
    0,
    &g_UsbDeviceCdcVcomConfig,
}};

